In [312]:
import pandas as pd
import numpy as np

df = pd.read_csv("chipotle.tsv", sep="\t")
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [313]:
df.shape

(4622, 5)

In [314]:
df.size

23110

In [315]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [316]:
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [317]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [318]:
df.describe(include = "all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

In [319]:
df.item_price = df.item_price.apply(lambda x : float(x.replace('$','')))
df.describe()

          order_id     quantity   item_price
count  4622.000000  4622.000000  4622.000000
mean    927.254868     1.075725     7.464336
std     528.890796     0.410186     4.245557
min       1.000000     1.000000     1.090000
25%     477.250000     1.000000     3.390000
50%     926.000000     1.000000     8.750000
75%    1393.000000     1.000000     9.250000
max    1834.000000    15.000000    44.250000

In [320]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [321]:
df.loc[(df.item_name == "Izze") & (df.item_price == 3.39) ]

      order_id  quantity item_name choice_description  item_price
1            1         1      Izze       [Clementine]        3.39
24          12         1      Izze       [Grapefruit]        3.39
47          21         1      Izze       [Blackberry]        3.39
66          30         1      Izze       [Blackberry]        3.39
359        155         1      Izze       [Blackberry]        3.39
360        155         1      Izze       [Grapefruit]        3.39
430        186         1      Izze       [Grapefruit]        3.39
579        237         1      Izze       [Clementine]        3.39
580        237         1      Izze       [Grapefruit]        3.39
1059       436         1      Izze       [Clementine]        3.39
1213       495         1      Izze       [Clementine]        3.39
1611       651         1      Izze       [Blackberry]        3.39
1612       651         1      Izze       [Blackberry]        3.39
1680       680         1      Izze       [Clementine]        3.39
2088       842         1      Izze       [Clementine]        3.39
2619      1040         1      Izze       [Clementine]        3.39
2634      1046         1      Izze       [Clementine]        3.39
2758      1095         1      Izze       [Blackberry]        3.39
2891      1149         1      Izze       [Blackberry]        3.39
3669      1468         1      Izze       [Blackberry]        3.39

In [322]:
df["Total_Price"] = df.quantity	* df.item_price
df.head(5)

,order_id,quantity,item_name,choice_description,item_price,Total_Price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [323]:
df["Total_Price"].sum()

39237.02

In [324]:
c = df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending= False).head(1)

item_name
Chicken Bowl    761
Name: quantity, dtype: int64

In [325]:
df.item_name.nunique()

50